FradSer/open-deskos/research/esp32-p4-c6-deskos/firmware/application/open_deskos/boards/waveshare/esp32_s3_touch_lcd_2_8/sdkconfig.defaults.board
# Waveshare ESP32-S3 Touch LCD 2.8 board defaults.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_s3_16MB.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Keep the USB Serial/JTAG console used by the connected S3 board.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Keep the launcher-only firmware from pulling in the emote asset stack.
# The board display is owned by the Open DeskOS LVGL path.
# CONFIG_APP_CLAW_ENABLE_EMOTE is not set

# Board-manager peripheral support.
CONFIG_ESP_BOARD_DEV_CUSTOM_SUPPORT=y
CONFIG_ESP_BOARD_PERIPH_I2C_SUPPORT=y
CONFIG_ESP_BOARD_PERIPH_SPI_SUPPORT=y
CONFIG_ESP_BOARD_PERIPH_LEDC_SUPPORT=y

# Small-screen LVGL shell. ESP32-S3 has no PPA peripheral; use the normal
# SPI partial renderer instead of the P4-only PPA path.
CONFIG_LV_USE_PPA=n
CONFIG_LV_USE_PPA_IMG=n
CONFIG_LV_DRAW_BUF_ALIGN=4
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=64
CONFIG_LV_TINY_TTF_CACHE_KERNING_CNT=64
